Revit 2024 API
BuiltInFailures.ImportFailures.IFCPartialSchemaSupport Property
 IFC versions 4 and above are only partially supported by Open IFC. Consider using Link IFC instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId IFCPartialSchemaSupport { get; }
Visual Basic
Public Shared ReadOnly Property IFCPartialSchemaSupport As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ IFCPartialSchemaSupport {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace